app/controllers/transaction/transaction_controller.rb

	def do_transfer
    recipient_param = params.permit(:wallet_name)
    wallet_to = Wallet.find_by_name(recipient_param[:wallet_name])
---
SELECT  "wallets".* FROM "wallets" WHERE "wallets"."name" = ? LIMIT ?  [["name", "L0OCN"], ["LIMIT", 1]]