app/views/shared/_wallet_info.html.erb

<p>Wallet Number: <%= current_user.wallet.no %></p>
<p>Registered At: <%= current_user.wallet.created_at.to_s(:long) %></p>
---
INSERT INTO "wallets" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "JBEL0"], ["user_id", 2], ["created_at", "2019-09-25 07:20:04.124535"], ["updated_at", "2019-09-25 07:20:04.124535"]]