app/controllers/application_controller.rb

SELECT  "wallets".* FROM "wallets" WHERE "wallets"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
---
    def load_wallet_info(current_user)
        wallet = current_user.wallet
        wallet = current_user.open_wallet if wallet.blank?