app/models/deposit.rb

  def self.save_history(wallet_to, amount, item, donatur, notes)
    transaction_history = wallet_to.user.deposits.new
    transaction_history.item = item
    transaction_history.donatur = donatur
    transaction_history.notes = notes
    transaction_history.amount = amount
    transaction_history.to = wallet_to
    transaction_history.save
---
INSERT INTO "transaction_histories" ("amount", "to_id", "type", "last_balance", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["amount", 1.0], ["to_id", 1], ["type", "Deposit"], ["last_balance", 1.0], ["user_id", 1], ["created_at", "2019-09-25 07:01:57.407233"], ["updated_at", "2019-09-25 07:01:57.407233"]]