app/models/transfer.rb

  def self.save_history(wallet_from, wallet_to, amount)
    return false unless self.amount_valid?(amount)
    ActiveRecord::Base.transaction do
        transaction_history = wallet_from.user.transfers.new
        transaction_history.amount = amount
        transaction_history.from = wallet_from
        transaction_history.to = wallet_to
        transaction_history.last_balance = wallet_from.balance
        transaction_history.save!

        transaction_history = wallet_to.user.deposits.new
        transaction_history.amount = amount
        transaction_history.from = wallet_from
        transaction_history.to = wallet_to
        transaction_history.last_balance = wallet_to.balance
        transaction_history.save!
---
INSERT INTO "transaction_histories" ("amount", "from_id", "to_id", "type", "last_balance", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)