app/models/wallet.rb

INSERT INTO "wallets" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "KHVKB"], ["user_id", 1], ["created_at", "2019-09-25 04:29:34.689155"], ["updated_at", "2019-09-25 04:29:34.689155"]]
SELECT  1 AS one FROM "wallets" WHERE "wallets"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
	def get_running_balance(running_id)
		# as the instruction to summing records...
		sum_credit(running_id) -  sum_debit(running_id)
	end

	class << self
		def open(user)
			return user.wallet if user.wallet.present?

UPDATE "wallets" SET "balance" = ?, "updated_at" = ? WHERE "wallets"."id" = ?  [["balance", 105.0], ["updated_at", "2019-09-25 07:21:43.810286"], ["id", 1]]
---
	def deposit(amount)
		return false unless amount_valid?(amount)
		ActiveRecord::Base.transaction do
			# self.balance = (self.balance += amount).round(2)
			self.save!

UPDATE "wallets" SET "balance" = ?, "updated_at" = ? WHERE "wallets"."id" = ?  [["balance", 29.0], ["updated_at", "2019-09-25 08:17:40.114975"], ["id", 2]]
---
	def withdraw(amount)
		return false unless amount_enough?(amount, self.balance)
		ActiveRecord::Base.transaction do
			# self.balance = (self.balance -= amount).round(2)
			self.save!

UPDATE "wallets" SET "balance" = ?, "updated_at" = ? WHERE "wallets"."id" = ?  [["balance", 35.0], ["updated_at", "2019-09-25 07:41:52.148658"], ["id", 2]]
---
	def transfer(wallet_to, amount)
		return false unless amount_enough?(amount, self.balance)
		ActiveRecord::Base.transaction do
			# reduce from
			# self.balance = (self.balance -= amount).round(2)
			self.save!