app/models/withdrawal.rb

INSERT INTO "transaction_histories" ("amount", "from_id", "type", "last_balance", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["amount", 10.0], ["from_id", 1], ["type", "Withdrawal"], ["last_balance", 105.0], ["user_id", 1], ["created_at", "2019-09-25 07:22:13.624006"], ["updated_at", "2019-09-25 07:22:13.624006"]]
---
  def self.save_history(wallet_from, amount)
    return false unless self.amount_valid?(amount)
    transaction_history = wallet_from.user.withdrawals.new
    transaction_history.amount = amount
    transaction_history.from = wallet_from
    transaction_history.last_balance = wallet_from.balance
    transaction_history.save!